package Homework1;

/**
 * Java: Знакомство и как пользоваться базовым API (семинары).
 * Урок 1. Знакомство с языком программирования Java.
 *
 * Задание (Формат сдачи: ссылка на подписанный git-проект):
 *
 * 1) Вычислить n-ое треугольного число (сумма чисел от 1 до n), n!
 * (произведение чисел от 1 до n).
 * 2) Вывести все простые числа от 1 до 1000.
 * 3) Реализовать простой калькулятор.
 *
 * 4) Дополнительное задание:
 * Задано уравнение вида q + w = e, q, w, e >= 0.
 * Некоторые цифры могут быть заменены знаком вопроса, например, 2? + ?5 = 69.
 * Требуется восстановить выражение до верного равенства.
 * Предложить хотя бы одно решение или сообщить, что его нет.
 */
public class Task2_hw1 {

}
