package Homeworks.Homework_02;

/**
 * Java: знакомство и как пользоваться базовым API (семинары).\
 * Урок 2. Почему вы не можете не использовать API.
 * Формат сдачи: ссылка на подписанный git-проект.
 *
 * Задание:
 *
 * 1) Дана строка sql-запроса "select * from students where ".
 * - Сформируйте часть WHERE этого запроса, используя StringBuilder.
 * - Данные для фильтрации приведены ниже в виде строки.
 * - Параметры для фильтрации:
 * {"name":"Ivanov", "country":"Russia", "city":"Moscow", "age":"null"}
 * - Если значение null, то параметр не должен попадать в запрос.
 *
 * 2) Реализуйте алгоритм сортировки пузырьком числового массива, результат
 * после каждой итерации запишите в лог-файл.
 *
 * 3) К калькулятору из предыдущего ДЗ добавить логирование.
 */

public class Homework_02 {

}
